Revit 2027 API
SymbolTypeId.DegreeC Property
 Symbol °C, indicating unit Celsius.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DegreeC { get; }
Public Shared ReadOnly Property DegreeC As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DegreeC {
	ForgeTypeId^ get ();
}
static member DegreeC : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace